nxp-mcuxpresso/mcux-soc-svd/MCXN547/MCXN547_cm33_core1.xml
        <register>
          <name>RCR3</name>
          <description>Receive Configuration 3</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDFL</name>
              <description>Word Flag Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WORD_1</name>
                  <description>Word 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_2</name>
                  <description>Word 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_2</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_3</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_4</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_5</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_6</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_7</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_8</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_9</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_10</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_11</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_25</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_26</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_27</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_28</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_29</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_30</name>
                  <description>Word (WDFL value + 1)</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_MAX</name>
                  <description>Word 32</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCE</name>
              <description>Receive Channel Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFR</name>
              <description>Channel FIFO Reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCR4</name>
          <description>Receive Configuration 4</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSD</name>
              <description>Frame Sync Direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_TARGET_MODE</name>
                  <description>Generated externally in Target mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_CONTROLLER_MODE</name>
                  <description>Generated internally in Controller mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSP</name>
              <description>Frame Sync Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_HIGH</name>
                  <description>Active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LOW</name>
                  <description>Active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONDEM</name>
              <description>On-Demand Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Generated continuously</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Generated when the FIFO warning flag is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSE</name>
              <description>Frame Sync Early</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>First bit of the frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>One bit before the first bit of the frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MF</name>
              <description>MSB First</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LSB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>MSB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYWD</name>
              <description>Sync Width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_CLOCKS</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_2</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_3</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_4</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_5</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_6</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_7</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_8</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_9</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_10</name>
                  <description>(SYWD value + 1)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_11</name>
                  <description>(SYWD value + 1)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_25</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_26</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_27</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_28</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_29</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_CLOCKS_30</name>
                  <description>(SYWD value + 1)</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYTWO_CLOCKS</name>
                  <description>32</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRSZ</name>
              <description>Frame Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_WORD</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_WORDS</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_2</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_3</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_4</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_5</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_6</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_7</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_8</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_9</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_10</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_11</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_25</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_26</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_27</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_28</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_29</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_WORDS_30</name>
                  <description>(FRSZ value + 1)</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX_WORDS</name>
                  <description>32</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPACK</name>
              <description>FIFO Packing Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_BIT_PACKING</name>
                  <description>Enable 8-bit FIFO packing</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN_BIT_PACKING</name>
                  <description>Enable 16-bit FIFO packing</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCOMB</name>
              <description>FIFO Combine Mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENA_ON_FIFO_WRITES</name>
                  <description>Enable on FIFO writes (from receive shift registers)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENA_ON_FIFO_READS</name>
                  <description>Enable on FIFO reads (by software)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENA_ON_FIFO_WRITES_READS</name>
                  <description>Enable on FIFO writes (from receive shift registers) and reads (by software)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCONT</name>
              <description>FIFO Continue on Error</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>From the start of the next frame after the FIFO error flag is cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>From the same word that caused the FIFO error to become 1 after the FIFO warning flag is cleared</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
