nxp-mcuxpresso/mcux-soc-svd/MCXN547/MCXN547_cm33_core1.xml
        <register>
          <name>PRES_STATE</name>
          <description>Present State</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8080</resetValue>
          <resetMask>0x72FFF7</resetMask>
          <fields>
            <field>
              <name>CIHB</name>
              <description>Command inhibit (CMD)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIHB_a</name>
                  <description>Can issue command using only CMD line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIHB_b</name>
                  <description>Cannot issue command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDIHB</name>
              <description>Command Inhibit Data (DATA)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDIHB_b</name>
                  <description>Can issue command that uses the DATA line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIHB_A</name>
                  <description>Cannot issue command that uses the DATA line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLA</name>
              <description>Data line active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLA_A</name>
                  <description>DATA line inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLA_b</name>
                  <description>DATA line active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDSTB</name>
              <description>SD clock stable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDSTB_b</name>
                  <description>Clock is changing frequency and not stable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDSTB_A</name>
                  <description>Clock is stable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WTA</name>
              <description>Write transfer active</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WTA_B</name>
                  <description>No valid data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WTA_A</name>
                  <description>Transferring data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTA</name>
              <description>Read transfer active</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTA_B</name>
                  <description>No valid data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTA_A</name>
                  <description>Transferring data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWEN</name>
              <description>Buffer write enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BWEN_b</name>
                  <description>Write disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BWEN_A</name>
                  <description>Write enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BREN</name>
              <description>Buffer read enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BREN_B</name>
                  <description>Read disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREN_A</name>
                  <description>Read enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTR</name>
              <description>Re-Tuning Request (only for SD3.0 SDR104 mode)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTR_B</name>
                  <description>Fixed or well tuned sampling clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTR_A</name>
                  <description>Sampling clock needs re-tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSCD</name>
              <description>Tap select change done</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSCD_B</name>
                  <description>Delay cell select change is not finished.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSCD_A</name>
                  <description>Delay cell select change is finished.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINST</name>
              <description>Card inserted</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CINST_a</name>
                  <description>Power on reset or no card</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CINST_B</name>
                  <description>Card inserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLSL</name>
              <description>CMD line signal level</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLSL</name>
              <description>DATA[7:0] line signal level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>Data 0 line signal level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>Data 1 line signal level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>Data 2 line signal level</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA3</name>
                  <description>Data 3 line signal level</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA4</name>
                  <description>Data 4 line signal level</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA5</name>
                  <description>Data 5 line signal level</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA6</name>
                  <description>Data 6 line signal level</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA7</name>
                  <description>Data 7 line signal level</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_CTRL</name>
          <description>Protocol Control</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8800020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTW</name>
              <description>Data transfer width</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTW_C</name>
                  <description>1-bit mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTW_B</name>
                  <description>4-bit mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTW_A</name>
                  <description>8-bit mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D3CD</name>
              <description>DATA3 as card detection pin</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D3CD_B</name>
                  <description>DATA3 does not monitor card insertion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D3CD_A</name>
                  <description>DATA3 as card detection pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMODE</name>
              <description>Endian mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMODE_A</name>
                  <description>Big endian mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMODE_B</name>
                  <description>Half word big endian mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMODE_C</name>
                  <description>Little endian mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASEL</name>
              <description>DMA select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASEL_A</name>
                  <description>No DMA or simple DMA is selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASEL_b</name>
                  <description>ADMA1 is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASEL_C</name>
                  <description>ADMA2 is selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SABGREQ</name>
              <description>Stop at block gap request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SABGREQ_b</name>
                  <description>Transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SABGREQ_A</name>
                  <description>Stop</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CREQ</name>
              <description>Continue request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CREQ_B</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CREQ_A</name>
                  <description>Restart</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWCTL</name>
              <description>Read wait control</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWCTL_b</name>
                  <description>Disables read wait control and stop SD clock at block gap when SABGREQ field is set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWCTL_A</name>
                  <description>Enables read wait control and assert read wait without stopping SD clock at block gap when SABGREQ field is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IABG</name>
              <description>Interrupt at block gap</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IABG_b</name>
                  <description>Disables interrupt at block gap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IABG_A</name>
                  <description>Enables interrupt at block gap</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DONE_NO_8CLK</name>
              <description>Read performed number 8 clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WECINT</name>
              <description>Wakeup event enable on card interrupt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WECINT_A</name>
                  <description>Disables wakeup event enable on card interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WECINT_b</name>
                  <description>Enables wakeup event enable on card interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WECINS</name>
              <description>Wakeup event enable on SD card insertion</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WECINS_b</name>
                  <description>Disable wakeup event enable on SD card insertion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WECINS_A</name>
                  <description>Enable wakeup event enable on SD card insertion</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WECRM</name>
              <description>Wakeup event enable on SD card removal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WECRM_B</name>
                  <description>Disables wakeup event enable on SD card removal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WECRM_A</name>
                  <description>Enables wakeup event enable on SD card removal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURST_LEN_EN</name>
              <description>BURST length enable for INCR, INCR4 / INCR8 / INCR16, INCR4-WRAP / INCR8-WRAP / INCR16-WRAP</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BURST_A</name>
                  <description>Burst length is enabled for INCR.</description>
                  <value>#xx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST_B</name>
                  <description>Burst length is enabled for INCR4 / INCR8 / INCR16.</description>
                  <value>#x1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST_C</name>
                  <description>Burst length is enabled for INCR4-WRAP / INCR8-WRAP / INCR16-WRAP.</description>
                  <value>#1xx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NON_EXACT_BLK_RD</name>
              <description>Non-exact block read</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXACT_B</name>
                  <description>The block read is exact block read. Host driver does not need to issue abort command to terminate this multi-block read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXACT_A</name>
                  <description>The block read is non-exact block read. Host driver needs to issue abort command to terminate this multi-block read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
